# Подвиг 5. Напишите программу ввода двух строк (каждая вводится с новой строки) и их объединения в одну строку через
# пробел. Результат выведите на экран.
# ====================
# Sample Input:
# hello python
# i love you
# ====================
# Sample Output:
# hello python i love you


a = str(input())
b = str(input())
print(a + " " + b)