# Словарь тегов и папок, куда перемещать заметки
FOLDER_BY_TAG = {
    "задача": "Personal/Задачи",
    "статья": "Personal/Статьи",
    "изучить": "Personal/Изучить",
    "читать": "Personal/Книги/Список_книг",
    "смотреть": "Personal/Смотреть",
    "слушать": "Personal/Слушать",
    "проект": "Personal/Проекты",
    "месяц": "Personal/Календарь/Год и месяцы",
    "год": "Personal/Календарь/Год и месяцы",
    "день": "Personal/Календарь/Ежедневные заметки",
    "работа": "Leroy_merlin/Задачи",
    "выполнено": "Personal/Задачи/Выполнено"
}
# Формат даты для обработки
DATE_FORMAT = "%Y-%m-%dT%H:%M:%S"
