# Подвиг 6. На вход программы подается целое десятичное число. Используя битовые операции, выполните целочисленное
# деление введенного числа на 2. Результат отобразите на экране.


N = int(input())
N = N >> 1
print(N)